<template>
  <div class="container mx-auto">
    <!--<transition-group-->
    <!--name="slide-fade"-->
    <!--appear-->
    <!--duration="{ enter: 500, leave: 800 }"-->
    <!--&gt;-->
    <!--<div class="flex flex-inline my-10">-->
    <!--<div key="0" class="w-1/4 bg-gray-200 text-center"><i class="mdi mdi-speedometer"></i></div>-->
    <!--<div key="1" class="w-1/4 bg-gray-300 text-center">2</div>-->
    <!--<div key="2" class="w-1/4 bg-gray-400 text-center">3</div>-->
    <!--<div key="3" class="w-1/4 bg-gray-500 text-center">4</div>-->
    <!--</div>-->
    <!--</transition-group>-->

    <div class="flex flex-wrap content-center h-48 my-4 ">
      <div class="w-full text-center my-2">
        <p class="text-4xl md:text-3xl uppercase">Core Value</p>
      </div>

      <!-- Code -->
      <div class="flex w-full rounded-lg bg-gray-200">
        <div class="w-1/4 p-2">
          <div class="bg-white rounded-lg border overflow-hidden border-gray-400 p-4 text-center">
            <svg class="fill-current text-teal-500 inline-block h-12 w-12" xmlns="http://www.w3.org/2000/svg"
                 viewBox="0 0 20 20">
              <path
                d="M0.707106781,10.7071068 L-2.00988464e-13,10 L5.48528137,4.51471863 L6.89949494,5.92893219 L2.82842712,10 L6.89949494,14.0710678 L5.48528137,15.4852814 L0.707106781,10.7071068 Z M19.2928932,10.7071068 L20,10 L14.5147186,4.51471863 L13.1005051,5.92893219 L17.1715729,10 L13.1005051,14.0710678 L14.5147186,15.4852814 L19.2928932,10.7071068 Z"
                id="Combined-Shape"></path>
            </svg>
            <div class="mb-1 font-bold">Code</div>
            <div class="text-xs">더 가치 있고, 모던한 코드를 생산하는것을 좋아합니다.</div>
          </div>
        </div>
        <!-- Recollect -->
        <div class="w-1/4 p-2">
          <div class="bg-white rounded-lg border overflow-hidden border-gray-400 p-4 text-center">
            <svg class="fill-current text-teal-500 inline-block h-12 w-12" xmlns="http://www.w3.org/2000/svg"
                 viewBox="0 0 20 20">
              <path
                d="M4.99201702,4 C3.8918564,4 3,4.88670635 3,5.99810135 L3,12 L0,12 L4,16 L8,12 L5,12 L5,6 L12,6 L14,4 L4.99201702,4 Z M15,8 L12,8 L16,4 L20,8 L17,8 L17,14.0018986 C17,15.1054196 16.0998238,16 15.007983,16 L6,16 L8,14 L15,14 L15,8 Z"
                id="Combined-Shape"></path>
            </svg>
            <div class="mb-1 font-bold">Recollect</div>
            <div class="text-xs">더 나은 삽질을 위하여 항상 회고합니다.</div>
          </div>
        </div>
        <!-- Sharing -->
        <div class="w-1/4 p-2">
          <div class="bg-white rounded-lg border overflow-hidden border-gray-400 p-4 text-center">
            <svg class="fill-current text-teal-500 inline-block h-12 w-12" xmlns="http://www.w3.org/2000/svg"
                 viewBox="0 0 20 20">
              <path
                d="M5.08261143,12.1593397 C4.54304902,12.6798471 3.80891237,13 3,13 C1.34314575,13 0,11.6568542 0,10 C0,8.34314575 1.34314575,7 3,7 C3.80891237,7 4.54304902,7.32015293 5.08261143,7.84066029 L14.0226687,3.37063167 C14.0077053,3.24918566 14,3.12549267 14,3 C14,1.34314575 15.3431458,0 17,0 C18.6568542,0 20,1.34314575 20,3 C20,4.65685425 18.6568542,6 17,6 C16.1910876,6 15.456951,5.67984707 14.9173886,5.15933971 L5.97733131,9.62936833 C5.99229467,9.75081434 6,9.87450733 6,10 C6,10.1254927 5.99229467,10.2491857 5.97733131,10.3706317 L14.9173886,14.8406603 C15.456951,14.3201529 16.1910876,14 17,14 C18.6568542,14 20,15.3431458 20,17 C20,18.6568542 18.6568542,20 17,20 C15.3431458,20 14,18.6568542 14,17 C14,16.8745073 14.0077053,16.7508143 14.0226687,16.6293683 L5.08261143,12.1593397 L5.08261143,12.1593397 Z"
                id="Combined-Shape"></path>
            </svg>
            <div class="mb-1 font-bold">Sharing</div>
            <div class="text-xs">많은 지식을 나누고, 함께 하는것을 좋아합니다.</div>
          </div>
        </div>
        <!-- Study -->
        <div class="w-1/4 p-2">
          <div class="bg-white rounded-lg border overflow-hidden border-gray-400 p-4 text-center">
            <svg class="fill-current text-teal-500 inline-block h-12 w-12" xmlns="http://www.w3.org/2000/svg"
                 viewBox="0 0 20 20">
              <path
                d="M4,10 L12,10 L12,12 L4,12 L4,10 L4,10 Z M4,14 L12,14 L12,16 L4,16 L4,14 L4,14 Z M4,4 L12,4 L12,8 L4,8 L4,4 L4,4 Z M16,2 L16,1 L16,0 L0,0 L0,1 L0,1 L0,17.0057979 C0,18.656688 1.34320226,20 3.00012623,20 L17,20 C18.6534829,20 20,18.6601943 20,17.0074602 L20,3 L20,2 L16,2 L16,2 L16,2 Z M16,4 L16,17.0066023 C16,17.5552407 16.4438648,18 17,18 C17.5522847,18 18,17.5553691 18,16.9991283 L18,4 L16,4 L16,4 L16,4 Z M2,2 L14,2 L14,17.0057979 C14,17.3541355 14.0597981,17.6887794 14.1697239,18 L3.00748397,18 C2.44892021,18 2,17.5552407 2,17.0066023 L2,2 L2,2 L2,2 L2,2 Z"
                id="Combined-Shape"></path>
            </svg>
            <div class="mb-1 font-bold">Study</div>
            <div class="text-xs">부족한 것이 많습니다. 그렇기에 학습을 꾸준히 합니다.</div>
          </div>
        </div>
      </div>
    </div>

    <div class="flex my-4 mb-4">
      <div class="p-3 w-2/6 bg-gray-300">
        <div class="flex flex-col">
          <div class="flex justify-center">
            <img class="rounded-full md:w-40" src="/Connor.jpg" title="To Profile">
          </div>
          <div class="text-center">
            <p class="text-6xl md:text-6xl uppercase">MinTae-Kim</p>
          </div>
        </div>
      </div>
      <div class="flex-col p-3 w-4/6 bg-gray-400">
        <p class="text-sm md:text-lg font-semibold">능력치(매우 주관적)</p>
        <div class="my-2">
          <div class="flex flex-row justify-between">
            <div v-for="item in itmes" class="mx-1">
              <!--              <vc-donut-->
              <!--                :sections="[{ 'value':item.value}]"-->
              <!--                :size="100"-->
              <!--              >-->
              <!--                <p class="text-sm md:text-mg uppercase">{{item.label}}</p>-->
              <!--              </vc-donut>-->
              <!--              <p class="text-center">{{ item.value }}점</p>-->

              <t-dropdown
                dropdown-class="w-64 bg-blue-500 text-white border-blue-500 rounded-lg border shadow-md p-6 z-10"
                :text="item.label"
              >
                <p></p>
              </t-dropdown>
            </div>
          </div>
        </div>
      </div>
    </div>

    <div class="w-full px-1">
      <div>
        <p>관심 기술</p>
      </div>
      <div class="flex flex-wrap content-start bg-gray-200">
        <!-- php -->
        <div class="w-1/5 p-2 text-center">
          <svg class="inline-block" style="enable-background:new 0 0 568 305;" version="1.1" viewBox="0 0 568 305" xml:space="preserve" xmlns="http://www.w3.org/2000/svg" xmlns:xlink="http://www.w3.org/1999/xlink"><style type="text/css">	.st0{fill:url(#SVGID_1_);}  .st1{fill:#6181B6;}  .st2{fill:#FFFFFF;}</style><radialGradient cx="147" cy="240" gradientTransform="matrix(1 0 0 -1 26.5198 300.8029)" gradientUnits="userSpaceOnUse" id="SVGID_1_" r="363.0565"><stop offset="0" style="stop-color:#FFFFFF"/><stop offset="0.5" style="stop-color:#4C6B97"/><stop offset="1" style="stop-color:#000000"/></radialGradient><ellipse class="st0" cx="284" cy="155.1" rx="276.5" ry="145.4"/><ellipse class="st1" cx="284" cy="155.1" rx="265.7" ry="134.6"/><g><path class="st2" d="M337.8,198.6l13.2-67.8c3-15.3,0.5-26.7-7.4-33.9c-7.6-7-20.5-10.4-39.5-10.4h-22.8l6.5-33.6   c0.2-1.3-0.1-2.6-0.9-3.6c-0.8-1-2-1.6-3.3-1.6h-31.5c-2.1,0-3.8,1.5-4.2,3.5l-14,72c-1.3-8.1-4.4-15.1-9.4-20.8   c-9.2-10.6-23.9-15.9-43.4-15.9H120c-2.1,0-3.8,1.5-4.2,3.5L87.4,235.7c-0.2,1.3,0.1,2.6,0.9,3.6c0.8,1,2,1.6,3.3,1.6h31.8   c2.1,0,3.8-1.5,4.2-3.5l6.9-35.3h23.6c12.4,0,22.8-1.3,31-4c8.3-2.7,16-7.3,22.7-13.6c5.5-5,10-10.6,13.4-16.7l-5.7,29.1   c-0.2,1.3,0.1,2.6,0.9,3.6s2,1.6,3.3,1.6h31.5c2.1,0,3.8-1.5,4.2-3.5l15.5-80h21.6c9.2,0,11.9,1.8,12.6,2.6   c0.7,0.7,2.1,3.3,0.5,11.2L297.3,197c-0.2,1.3,0.1,2.6,0.9,3.6c0.8,1,2,1.6,3.3,1.6h32C335.6,202.1,337.4,200.7,337.8,198.6z    M191.8,142.6c-2,10.2-5.7,17.4-11.1,21.6c-5.5,4.2-14.2,6.3-26,6.3h-14.1l10.2-52.4H169c13.4,0,18.8,2.9,20.9,5.3   C192.9,126.7,193.6,133.3,191.8,142.6z"/><path class="st2" d="M472.5,102.4c-9.2-10.6-23.9-15.9-43.4-15.9H368c-2.1,0-3.8,1.5-4.2,3.5l-28.3,145.8c-0.2,1.3,0.1,2.6,0.9,3.6   s2,1.6,3.3,1.6h31.8c2.1,0,3.8-1.5,4.2-3.5l6.9-35.3h23.6c12.4,0,22.8-1.3,31-4c8.3-2.7,16-7.3,22.7-13.6   c5.6-5.2,10.3-11,13.8-17.3c3.5-6.3,6-13.3,7.5-20.8C484.7,127.9,481.8,113.1,472.5,102.4z M439.6,142.6   c-2,10.2-5.7,17.4-11.1,21.6c-5.5,4.2-14.2,6.3-26,6.3h-14.1l10.2-52.4h18.2c13.4,0,18.8,2.9,20.9,5.3   C440.8,126.7,441.4,133.3,439.6,142.6z"/></g><g><path d="M169,113.8c12.1,0,20.1,2.2,24.1,6.7c4,4.5,5,12.1,2.9,22.9c-2.2,11.3-6.4,19.3-12.7,24.2c-6.3,4.8-15.8,7.2-28.6,7.2   h-19.3l11.9-61L169,113.8L169,113.8z M91.7,236.6h31.8l7.5-38.8h27.2c12,0,21.9-1.3,29.6-3.8c7.8-2.5,14.8-6.7,21.1-12.7   c5.3-4.9,9.6-10.3,12.9-16.2c3.3-5.9,5.6-12.4,7-19.5c3.4-17.3,0.8-30.7-7.6-40.4c-8.4-9.6-21.8-14.5-40.2-14.5H120L91.7,236.6z"/><path d="M252.2,52.1h31.5l-7.5,38.8h28.1c17.7,0,29.8,3.1,36.5,9.2c6.7,6.2,8.7,16.1,6,29.9l-13.2,67.8h-32l12.5-64.5   c1.4-7.3,0.9-12.3-1.6-15c-2.5-2.7-7.7-4-15.8-4h-25.2l-16.2,83.5h-31.5L252.2,52.1z"/><path d="M416.8,113.8c12.1,0,20.1,2.2,24.1,6.7c4,4.5,5,12.1,2.9,22.9c-2.2,11.3-6.4,19.3-12.7,24.2c-6.3,4.8-15.8,7.2-28.6,7.2   h-19.3l11.9-61L416.8,113.8L416.8,113.8z M339.5,236.6h31.8l7.5-38.8H406c12,0,21.9-1.3,29.6-3.8c7.8-2.5,14.8-6.7,21.1-12.7   c5.3-4.9,9.6-10.3,12.9-16.2c3.3-5.9,5.6-12.4,7-19.5c3.4-17.3,0.8-30.7-7.6-40.4c-8.4-9.6-21.8-14.5-40.2-14.5h-61.1L339.5,236.6z   "/></g></svg>
        </div>
        <!-- Laravel -->
        <div class="w-1/5 p-2 text-center">
          <svg class="inline-block" width="75" height="75" viewBox="0 0 50 50" xmlns="http://www.w3.org/2000/svg">
            <path
              d="M49.626 11.564a.809.809 0 0 1 .028.209v10.972a.8.8 0 0 1-.402.694l-9.209 5.302V39.25c0 .286-.152.55-.4.694L20.42 51.01c-.044.025-.092.041-.14.058-.018.006-.035.017-.054.022a.805.805 0 0 1-.41 0c-.022-.006-.042-.018-.063-.026-.044-.016-.09-.03-.132-.054L.402 39.944A.801.801 0 0 1 0 39.25V6.334c0-.072.01-.142.028-.21.006-.023.02-.044.028-.067.015-.042.029-.085.051-.124.015-.026.037-.047.055-.071.023-.032.044-.065.071-.093.023-.023.053-.04.079-.06.029-.024.055-.05.088-.069h.001l9.61-5.533a.802.802 0 0 1 .8 0l9.61 5.533h.002c.032.02.059.045.088.068.026.02.055.038.078.06.028.029.048.062.072.094.017.024.04.045.054.071.023.04.036.082.052.124.008.023.022.044.028.068a.809.809 0 0 1 .028.209v20.559l8.008-4.611v-10.51c0-.07.01-.141.028-.208.007-.024.02-.045.028-.068.016-.042.03-.085.052-.124.015-.026.037-.047.054-.071.024-.032.044-.065.072-.093.023-.023.052-.04.078-.06.03-.024.056-.05.088-.069h.001l9.611-5.533a.801.801 0 0 1 .8 0l9.61 5.533c.034.02.06.045.09.068.025.02.054.038.077.06.028.029.048.062.072.094.018.024.04.045.054.071.023.039.036.082.052.124.009.023.022.044.028.068zm-1.574 10.718v-9.124l-3.363 1.936-4.646 2.675v9.124l8.01-4.611zm-9.61 16.505v-9.13l-4.57 2.61-13.05 7.448v9.216l17.62-10.144zM1.602 7.719v31.068L19.22 48.93v-9.214l-9.204-5.209-.003-.002-.004-.002c-.031-.018-.057-.044-.086-.066-.025-.02-.054-.036-.076-.058l-.002-.003c-.026-.025-.044-.056-.066-.084-.02-.027-.044-.05-.06-.078l-.001-.003c-.018-.03-.029-.066-.042-.1-.013-.03-.03-.058-.038-.09v-.001c-.01-.038-.012-.078-.016-.117-.004-.03-.012-.06-.012-.09v-.002-21.481L4.965 9.654 1.602 7.72zm8.81-5.994L2.405 6.334l8.005 4.609 8.006-4.61-8.006-4.608zm4.164 28.764l4.645-2.674V7.719l-3.363 1.936-4.646 2.675v20.096l3.364-1.937zM39.243 7.164l-8.006 4.609 8.006 4.609 8.005-4.61-8.005-4.608zm-.801 10.605l-4.646-2.675-3.363-1.936v9.124l4.645 2.674 3.364 1.937v-9.124zM20.02 38.33l11.743-6.704 5.87-3.35-8-4.606-9.211 5.303-8.395 4.833 7.993 4.524z"
              fill="#FF2D20" fill-rule="evenodd"/>
          </svg>
        </div>
        <!-- JS -->
        <div class="w-1/5 p-2 text-center">
          <svg class="inline-block" style="enable-background:new 0 0 512 512;" version="1.1" viewBox="0 0 512 512" width="75"  height="75" xml:space="preserve" xmlns="http://www.w3.org/2000/svg" xmlns:xlink="http://www.w3.org/1999/xlink"><g id="_x31_87-js"><g><rect height="459.998" style="fill:#F0DB4F;" width="459.996" x="26.002" y="26.001"/><path d="M276.331,384.759c0,44.767-26.286,65.2-64.586,65.2c-34.601,0-54.623-17.865-64.892-39.529    l35.218-21.255c6.777,12.013,12.938,22.177,27.826,22.177c14.169,0,23.207-5.544,23.207-27.208V237.21h43.227V384.759    L276.331,384.759z" style="fill:#323330;"/><path d="M378.598,449.959c-40.147,0-66.124-19.099-78.754-44.151l35.219-20.332    c9.241,15.095,21.356,26.286,42.611,26.286c17.866,0,29.364-8.932,29.364-21.355c0-14.787-11.704-20.021-31.52-28.75l-10.781-4.62    c-31.214-13.246-51.853-29.983-51.853-65.2c0-32.447,24.745-57.09,63.248-57.09c27.518,0,47.232,9.549,61.402,34.603    l-33.679,21.562c-7.392-13.246-15.401-18.481-27.825-18.481c-12.63,0-20.639,8.01-20.639,18.481    c0,12.938,8.009,18.176,26.594,26.285l10.78,4.621c36.759,15.71,57.397,31.832,57.397,67.974    C450.164,428.602,419.565,449.959,378.598,449.959L378.598,449.959z" style="fill:#323330;"/></g></g><g id="Layer_1"/></svg>
        </div>
        <!-- C# -->
        <div class="w-1/5 p-2 text-center">
          <svg class="inline-block" xmlns="http://www.w3.org/2000/svg" x="0px" y="0px"
               width="75" height="75"
               viewBox="0 0 50 50"
               style=" fill:#000000;">
            <path
              d="M 25 2 C 24.285156 2 23.570313 2.179688 22.933594 2.539063 L 6.089844 12.003906 C 4.800781 12.726563 4 14.082031 4 15.535156 L 4 34.464844 C 4 35.917969 4.800781 37.273438 6.089844 37.996094 L 22.933594 47.460938 C 23.570313 47.820313 24.285156 48 25 48 C 25.714844 48 26.429688 47.820313 27.066406 47.460938 L 43.910156 38 C 45.199219 37.273438 46 35.917969 46 34.464844 L 46 15.535156 C 46 14.082031 45.199219 12.726563 43.910156 12.003906 L 27.066406 2.539063 C 26.429688 2.179688 25.714844 2 25 2 Z M 25 13 C 28.78125 13 32.277344 14.753906 34.542969 17.738281 L 30.160156 20.277344 C 28.84375 18.835938 26.972656 18 25 18 C 21.140625 18 18 21.140625 18 25 C 18 28.859375 21.140625 32 25 32 C 26.972656 32 28.84375 31.164063 30.160156 29.722656 L 34.542969 32.261719 C 32.277344 35.246094 28.78125 37 25 37 C 18.382813 37 13 31.617188 13 25 C 13 18.382813 18.382813 13 25 13 Z M 35 20 L 37 20 L 37 22 L 39 22 L 39 20 L 41 20 L 41 22 L 43 22 L 43 24 L 41 24 L 41 26 L 43 26 L 43 28 L 41 28 L 41 30 L 39 30 L 39 28 L 37 28 L 37 30 L 35 30 L 35 28 L 33 28 L 33 26 L 35 26 L 35 24 L 33 24 L 33 22 L 35 22 Z M 37 24 L 37 26 L 39 26 L 39 24 Z"></path>
          </svg>
        </div>
      </div>
    </div>
  </div>
</template>
<script>

  export default {
    name: 'about',
    components: {},

    data: () => ({

      icons: null,
      show: true,
      chartdata: {
        labels: ['January', 'February'],
        datasets: [
          {
            label: 'Data One',
            backgroundColor: '#f87979',
            data: [40, 20],
          },
        ],
      },
      options: {
        responsive: true,
        maintainAspectRatio: false,
      },
      itmes: [
        {label: 'PHP', value: 77},
        {label: 'JS', value: 60},
        {label: 'MySql', value: 60},
        {label: 'HTML/CSS', value: 50},
        {label: 'C#', value: 60},
        {label: 'Linux', value: 50},
        {label: 'python', value: 40},
      ],
      interests: [
        'php',
        'laravel',
        'js',
        'vuejs',
        'node',
        'react',
        'github',
        'python',
        'csharp',
      ],
    }),
    methods: {},
    mounted() {
    },
  };
</script>

<style scoped>
  /** 1. 어떻게 노출될 것인가. 처음 진입 시작부 **/
  .slide-fade-enter, .slide-fade-leave-to {
    transform: translateX(10px);
    opacity: 0;
  }

  /* 2. 애니메이션 진입 및 진출은 다른 지속 시간 및  */
  /* 타이밍 기능을 사용할 수 있습니다. */
  .slide-fade-enter-active {
    transition: all .5s ease;
  }

  /* 3. leave-active 될때 */
  .slide-fade-leave-active {
    transition: all .8s cubic-bezier(1.0, 0.5, 0.8, 1.0);
  }
</style>
